app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Vacuum"], ["description", "Vacuum the first floor"], ["location", "Home"], ["created_at", "2015-01-06 16:56:27.757291"], ["updated_at", "2015-01-06 16:56:27.757291"]]
---
 def create
    @task = Task.new(params[:task])

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 0]]
---
def show
  @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "With focus"], ["updated_at", "2015-01-06 22:12:06.519607"], ["id", 10]]
---
def update
  @task = Task.find(params[:id])
  if @task.update(params[:task])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 7]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]
---
def destroy
    @task = Task.find(params[:id])
    @task.destroy